syntax.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Fan's syntax </title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Fan's syntax "/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-06-10T12:10+0200"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Fan's syntax </h1>

<p>Fan speaks OCaml natively, plus a few addons. 
</p>
<p>
There are some minor differences between Fan's concrete syntax and
OCaml though, the major differences is that Fan is more strict than
OCaml.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Difference from Caml syntax</h2>
<div class="outline-text-2" id="text-1">

<p>  Three particular points to be noticed:
</p><ol>
<li>Parens are necessary for tuples



<pre class="src src-ocaml"><span style="color: #585858; font-style: italic;">(** illegal *)</span>
a<span style="color: #f0e68c;">,</span>b 
<span style="color: #ffa500; font-weight: bold;">let</span> <span style="color: #0087ff;">a</span><span style="color: #f0e68c;">,</span><span style="color: #0087ff;">b </span><span style="color: #f0e68c;">=</span> f <span style="color: #ffa500; font-weight: bold;">in</span>
    body
</pre>





<pre class="src src-ocaml"><span style="color: #585858; font-style: italic;">(** correct syntax *)</span>
<span style="color: #f0e68c;">(</span>a<span style="color: #f0e68c;">,</span>b<span style="color: #f0e68c;">)</span>
<span style="color: #ffa500; font-weight: bold;">let</span><span style="color: #0087ff;"> </span><span style="color: #f0e68c;">(</span><span style="color: #0087ff;">a</span><span style="color: #f0e68c;">,</span><span style="color: #0087ff;">b</span><span style="color: #f0e68c;">)</span><span style="color: #0087ff;"> </span><span style="color: #f0e68c;">=</span> f <span style="color: #ffa500; font-weight: bold;">in</span>
    body
</pre>

</li>
<li>Parens or "begin" "end" necessary for semis



<pre class="src src-ocaml"><span style="color: #585858; font-style: italic;">(* </span><span style="color: #585858; font-style: italic;">illegal </span><span style="color: #585858; font-style: italic;">*)</span>
print_endline <span style="color: #00afaf;">"a"</span><span style="color: #f0e68c;">;</span> print_endline <span style="color: #00afaf;">"b"</span> 
</pre>


<pre class="src src-ocaml"><span style="color: #585858; font-style: italic;">(** correct *)</span>
<span style="color: #f0e68c;">(</span>print_endline <span style="color: #00afaf;">"a"</span><span style="color: #f0e68c;">;</span> print_endline <span style="color: #00afaf;">"b"</span><span style="color: #f0e68c;">)</span>
<span style="color: #ffa500; font-weight: bold;">begin</span> print_endline <span style="color: #00afaf;">"a"</span><span style="color: #f0e68c;">;</span> print_endline <span style="color: #00afaf;">"b"</span> <span style="color: #ffa500; font-weight: bold;">end</span>
</pre>

</li>
<li>First vertical bar is necessary for algebraic data type, pattern
     match.



<pre class="src src-ocaml"><span style="color: #585858; font-style: italic;">(** illegal *)</span>
<span style="color: #ffa500; font-weight: bold;">type</span> <span style="color: #af8700;">u </span><span style="color: #f0e68c;">=</span> A <span style="color: #f0e68c;">|</span> B
<span style="color: #ffa500; font-weight: bold;">let</span> <span style="color: #0087ff;">f</span><span style="color: #0087ff;"> </span><span style="color: #f0e68c;">=</span> <span style="color: #5f8700;">function</span>
    <span style="color: #0087ff;">A </span><span style="color: #f0e68c;">-&gt;</span> <span style="color: #00afaf;">"a"</span>
  <span style="color: #f0e68c;">|</span> B <span style="color: #f0e68c;">-&gt;</span> <span style="color: #00afaf;">"b"</span>
<span style="color: #ffa500; font-weight: bold;">let</span> <span style="color: #0087ff;">f </span><span style="color: #f0e68c;">=</span>
  <span style="color: #5f8700;">match</span> c <span style="color: #5f8700;">with</span>
    A <span style="color: #f0e68c;">-&gt;</span> <span style="color: #00afaf;">"a"</span>
  <span style="color: #f0e68c;">|</span> B <span style="color: #f0e68c;">-&gt;</span> <span style="color: #00afaf;">"b"</span>
</pre>





<pre class="src src-ocaml"><span style="color: #585858; font-style: italic;">(** correct *)</span>
<span style="color: #ffa500; font-weight: bold;">type</span> <span style="color: #af8700;">u </span><span style="color: #f0e68c;">=</span>
  <span style="color: #f0e68c;">|</span> A
  <span style="color: #f0e68c;">|</span> B 

<span style="color: #ffa500; font-weight: bold;">let</span> <span style="color: #0087ff;">f</span><span style="color: #0087ff;"> </span><span style="color: #f0e68c;">=</span> <span style="color: #5f8700;">function</span>
 <span style="color: #0087ff;"> </span><span style="color: #f0e68c;">|</span> A <span style="color: #f0e68c;">-&gt;</span> <span style="color: #00afaf;">"a"</span>
  <span style="color: #f0e68c;">|</span> B <span style="color: #f0e68c;">-&gt;</span> <span style="color: #00afaf;">"b"</span> 

<span style="color: #ffa500; font-weight: bold;">let</span> <span style="color: #0087ff;">f </span><span style="color: #f0e68c;">=</span>
  <span style="color: #5f8700;">match</span> c <span style="color: #5f8700;">with</span>
  <span style="color: #f0e68c;">|</span> A <span style="color: #f0e68c;">-&gt;</span> <span style="color: #00afaf;">"a"</span>
  <span style="color: #f0e68c;">|</span> B <span style="color: #f0e68c;">-&gt;</span> <span style="color: #00afaf;">"b"</span>

</pre>

</li>
<li>$ is a reserved operator, please don't take it as a function.
</li>
</ol>



</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduced syntax</h2>
<div class="outline-text-2" id="text-2">


<p>
  It mainly introduce two syntaxes, we call them delimited domain
  specific languages(DDSL).
</p>
<ol>
<li>compile time quotation




<pre class="src src-ocaml"><span style="color: #f0e68c;">#{:</span><span style="color: #af8700;">quot</span><span style="color: #f0e68c;">|</span> <span style="color: #f0e68c;">|}</span>     
</pre>


<p>
     Such quotation is purely compile time control language, it's a
     general view of such directives:
</p>



<pre class="src src-ocaml"><span style="color: #d75f00;">#load</span> <span style="color: #00afaf;">"xx.cmo"</span><span style="color: #f0e68c;">;;</span>
<span style="color: #d75f00;">#use</span> <span style="color: #00afaf;">"xx.ml"</span>  <span style="color: #f0e68c;">;;</span>
</pre>


<p>
     It can be used to interact with the Fan compiler, the user can
     register different compile time quotation language to make the
     whole file self-explainable, this helps simplify the build
     system a lot.
</p>
<p>     
     For example, there is a built-in control language
</p>



<pre class="src src-ocaml"><span style="color: #f0e68c;">#{:</span><span style="color: #af8700;">control</span><span style="color: #f0e68c;">|</span>
  default <span style="color: #00afaf;">"exp"</span><span style="color: #f0e68c;">;</span> <span style="color: #585858; font-style: italic;">(* </span><span style="color: #585858; font-style: italic;">set the default quotation </span><span style="color: #585858; font-style: italic;">*)</span>
  require <span style="color: #00afaf;">"ulex"</span><span style="color: #f0e68c;">;</span> <span style="color: #585858; font-style: italic;">(* </span><span style="color: #585858; font-style: italic;">require the feature</span><span style="color: #585858; font-style: italic;">*)</span>
  import <span style="color: #00afaf;">"Tutorial"</span><span style="color: #f0e68c;">;</span> <span style="color: #585858; font-style: italic;">(* </span><span style="color: #585858; font-style: italic;">import the language namespace</span><span style="color: #585858; font-style: italic;">*)</span>
  filter <span style="color: #00afaf;">"serialize"</span><span style="color: #f0e68c;">;</span> <span style="color: #585858; font-style: italic;">(* </span><span style="color: #585858; font-style: italic;">apply the filter serialize to the whole file </span><span style="color: #585858; font-style: italic;">*)</span>
  <span style="color: #f0e68c;">|}</span>     
</pre>


<p>     
     Another language eval, could eval all legal ocaml code at
     compile-time.
</p>



<pre class="src src-ocaml"><span style="color: #f0e68c;">#{:</span><span style="color: #af8700;">eval</span><span style="color: #f0e68c;">|</span>
<span style="color: #ffa500; font-weight: bold;">let</span> <span style="color: #0087ff;">v </span><span style="color: #f0e68c;">=</span> 3
<span style="color: #ffa500; font-weight: bold;">let</span> <span style="color: #0087ff;">b </span><span style="color: #f0e68c;">=</span> 3
<span style="color: #f0e68c;">|}</span>          
</pre>


<p>     
     This would help test the syntax extension on-the-fly.
</p>
<p>     
     <b>Note</b>: all the compile time DDSL should be put in the
     beginning, this is intentional, to work better  with IDE.
</p>
</li>
<li>Rewrite DDSL.

<p>
     The syntax is the same with compile-time DDSL  except without
     hash sign, one sample is as follows:
</p>



<pre class="src src-ocaml"><span style="color: #f0e68c;">{:</span><span style="color: #af8700;">exp</span><span style="color: #f0e68c;">|</span> 3 <span style="color: #f0e68c;">|}</span>
</pre>


<p>
     It  can appear in most places (detail later)
</p></li>
</ol>


</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-06-10T12:10+0200</p>
<p class="author">Author: </p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.1 with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
